yongli3/rt-thread/bsp/stm32f40x/applications/application.c
/*
 * File      : application.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2006, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 * 2014-04-27     Bernard      make code cleanup. 
 */

#include <board.h>
#include <rtthread.h>

#ifdef RT_USING_LWIP
#include <lwip/sys.h>
#include <lwip/api.h>
#include <netif/ethernetif.h>
#include "stm32f4xx_eth.h"
#endif

#ifdef RT_USING_GDB
#include <gdb_stub.h>
#endif
extern void led_thread_entry(void* parameter);

void rt_init_thread_entry(void* parameter)
{
    rt_thread_t thread;

    /* GDB STUB */
#ifdef RT_USING_GDB
    gdb_set_device("uart6");
    gdb_start();
#endif

    /* LwIP Initialization */
#ifdef RT_USING_LWIP
    {
        extern void lwip_sys_init(void);

        /* register ethernetif device */
        eth_system_device_init();

        // replace wih DM9000
        //rt_hw_stm32_eth_init();
        rt_hw_dm9000_init();

        /* init lwip system */
        lwip_sys_init();
        rt_kprintf("TCP/IP initialized!\n");
    }
#endif

#ifdef RT_USING_DFS
                /* initialize the device file system */
                dfs_init();
        
#ifdef RT_USING_DFS_ELMFAT
                /* initialize the elm chan FatFS file system*/
                elm_init();
#endif
        
#if defined(RT_USING_DFS_NFS) && defined(RT_USING_LWIP)
                /* initialize NFSv3 client file system */
                nfs_init();
#endif
        
#ifdef RT_USING_DFS_YAFFS2
                dfs_yaffs2_init();
#endif
        
#ifdef RT_USING_DFS_UFFS
                dfs_uffs_init();
#endif
        
#ifdef RT_USING_DFS_JFFS2
                dfs_jffs2_init();
#endif
        
#ifdef RT_USING_DFS_ROMFS
                dfs_romfs_init();
#endif
#ifdef RT_USING_DFS_RAMFS
                dfs_ramfs_init();
#endif
        
#ifdef RT_USING_DFS_DEVFS
                devfs_init();
#endif
#endif /* end of RT_USING_DFS */

#ifdef RT_USING_NEWLIB
                libc_system_init();
#else
                /* the pthread system initialization will be initiallized in libc */
#ifdef RT_USING_PTHREADS
                pthread_system_init();
#endif
#endif

#ifdef RT_USING_USB_HOST
                rt_usb_host_init();
#endif

		rt_kprintf("application_entry\n");

    /* Create led thread */
    thread = rt_thread_create("led", led_thread_entry, RT_NULL, 256, RT_THREAD_PRIORITY_MAX - 1, 20);
    if(thread != RT_NULL)
        rt_thread_startup(thread);
    
}

int rt_application_init()
{
    rt_thread_t tid;

    tid = rt_thread_create("init",
        rt_init_thread_entry, RT_NULL,
        2048, RT_THREAD_PRIORITY_MAX/3, 20);

    if (tid != RT_NULL)
        rt_thread_startup(tid);

    return 0;
}

/*@}*/
